{
  "backend/main.mo": "Motoko backend actor defining user profiles, friends, rooms, messages, guest support, and includes authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features with associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Global Tailwind CSS variables and OKLCH color definitions for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup with authentication gating, theme provider, profile setup modal, and routes including rooms.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a single chat message with reply preview, timestamp, and optional video content.",
  "frontend/src/components/chat/VideoMessageItem.tsx": "Displays a video message with loading indicator and rating controls using StarRating and useVideoRating.",
  "frontend/src/components/common/Avatar.tsx": "Renders a user avatar image with size options and a fallback default image.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main application layout with top bar, user menu, navigation, and logout handling.",
  "frontend/src/components/layout/GuestBadge.tsx": "Shows a small badge indicating a guest user.",
  "frontend/src/components/profile/ProfilePicturePicker.tsx": "Modal for uploading or capturing a new profile picture using file input or camera with update logic.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial profile creation with username and display name submission for authenticated users.",
  "frontend/src/components/ratings/StarRating.tsx": "Interactive star rating component supporting hover effects, half-stars, and disabled/read-only states.",
  "frontend/src/components/rooms/RoomMessageItem.tsx": "Renders a chat room message with sender info, timestamp, and optional attached video.",
  "frontend/src/components/video/VideoRecorderModal.tsx": "Modal for recording video via camera, previewing it, and sending as an ExternalBlob.",
  "frontend/src/components/video/VideoTrimmer.tsx": "Preview-only video trimming UI that lets users adjust start/end markers before sending the full video.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity, reinitializing and invalidating queries on identity changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "React-query hooks to fetch and update the authenticated user's profile and profile picture via the actor.",
  "frontend/src/hooks/useGuestSession.ts": "Manages guest session data in localStorage, including creation and clearing of guest identities.",
  "frontend/src/hooks/useInboxFriendProfiles.ts": "Fetches and maps profiles for a list of friends using parallel react-query requests.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a context for Internet Identity auth, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useParticipantIdentity.ts": "Returns the active participant identity, preferring authenticated users and falling back to guest sessions.",
  "frontend/src/hooks/useQueries.ts": "Collection of hooks for messages, friends, user profiles, and search operations using react-query and the actor.",
  "frontend/src/hooks/useRoomMessagesPolling.ts": "Provides polling-based room message fetching and mutation for sending messages.",
  "frontend/src/hooks/useRooms.ts": "Hooks for fetching rooms, creating/joining/leaving rooms, and retrieving room details via the actor.",
  "frontend/src/hooks/useVideoRatings.ts": "LocalStorage‑based mock video rating system with average and user rating handling.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point initializing React, QueryClient, Internet Identity, and global styles.",
  "frontend/src/pages/CallsPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/ChatDetailPage.tsx": "Displays a direct chat view, loads messages, supports text/video sending, replies, and auto-scroll behavior.",
  "frontend/src/pages/FriendsPage.tsx": "Shows the user's friends list with options to search, add, remove, and mark best friends using dialogs and mutations.",
  "frontend/src/pages/InboxPage.tsx": "Lists conversations based on the user's friends, loading their profiles and navigating to individual chats.",
  "frontend/src/pages/ProfilePage.tsx": "Renders and edits the current user's profile, including username, display name, and profile picture.",
  "frontend/src/pages/RoomChatPage.tsx": "Displays a group room chat with participant profile fetching, message sending, and auto-scrolling.",
  "frontend/src/pages/RoomsPage.tsx": "Lists available rooms and provides dialogs for creating rooms with join codes or joining existing ones.",
  "frontend/src/pages/SettingsPage.tsx": "UI page allowing users to view and update dark mode, theme color, and preview appearance settings with live updates.",
  "frontend/src/pages/SignInPage.tsx": "Sign-in page supporting Internet Identity login and guest sessions with form inputs and loading states.",
  "frontend/src/theme/ThemeProvider.tsx": "Provides theme context, syncing dark mode and primary color to user profile and applying OKLCH-based CSS variables.",
  "frontend/src/utils/blob.ts": "Converts File or Blob objects into ExternalBlob instances by reading their binary data.",
  "frontend/src/utils/color.ts": "Converts hex colors to OKLCH strings for CSS, including RGB-to-OKLab conversion and value clamping.",
  "frontend/src/utils/rooms.ts": "Generates random 6‑character room join codes and validates code format.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended theme colors using OKLCH variables, and custom plugins.",
  "project_state.json": "Describes the overall project state for MessageCenter, including features like identity options, messaging, rooms, video sharing, ratings, profiles, and theming, plus architectural notes and known UI issues. Also lists implemented features with requirement mappings and version info."
}