{
  "backend/main.mo": "Defines the main canister with authorization, storage mixins, user profiles, messaging, rooms, guests, and related state and helper functions.",
  "backend/migration.mo": "Provides a migration that trims and lowercases room join codes while preserving room data.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files covering routing, pages, hooks, components, and utilities.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH-based theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML skeleton mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, authentication handling (II and guests), theme provider, and main layout including rooms and chat routes.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a chat message bubble with reply preview, timestamp, and optional video content.",
  "frontend/src/components/chat/VideoMessageItem.tsx": "Displays a video message with loading state and integrated star rating UI using local rating hooks.",
  "frontend/src/components/common/Avatar.tsx": "Renders a user's avatar using their profile picture or a default image with configurable sizing.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with top bar, user menu, navigation, guest handling, and logout logic.",
  "frontend/src/components/layout/GuestBadge.tsx": "Displays a small 'Guest' badge using the Badge component.",
  "frontend/src/components/profile/ProfilePicturePicker.tsx": "Modal that lets users update their profile picture via file upload or camera capture.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that prompts new II users to set up username and display name and saves the profile via backend mutation.",
  "frontend/src/components/ratings/StarRating.tsx": "Interactive 1–5 star rating component with hover and half-star support.",
  "frontend/src/components/rooms/RoomMessageItem.tsx": "Renders a chat room message with sender info, text, optional video, and timestamp.",
  "frontend/src/components/video/VideoRecorderModal.tsx": "Modal for recording video, reviewing it, and sending it as an ExternalBlob.",
  "frontend/src/components/video/VideoTrimmer.tsx": "Simple video preview and fake trimming UI before sending the full video blob.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, invalidating queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks for fetching and mutating the current user’s profile and profile picture.",
  "frontend/src/hooks/useGuestSession.ts": "Manages guest session data using localStorage, providing creation, loading, and clearing of guest identities.",
  "frontend/src/hooks/useInboxFriendProfiles.ts": "Fetches profiles for a list of friends using react-query and returns a map of principal IDs to loading and profile data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for Internet Identity authentication, including login, logout, and stored identity restoration.",
  "frontend/src/hooks/useParticipantIdentity.ts": "Determines the active participant identity using either Internet Identity or a guest session and returns a simplified identity object.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for messages, friends, profiles, and user search, all backed by actor API calls.",
  "frontend/src/hooks/useRoomMessagesPolling.ts": "Polls and sends room messages with participant-aware authorization checks and error handling.",
  "frontend/src/hooks/useRooms.ts": "Provides room-related queries and mutations such as listing rooms, creating or joining rooms, and fetching room details.",
  "frontend/src/hooks/useVideoRatings.ts": "Implements a localStorage‑based mock video rating system with average, count, and user rating tracking.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and applying global base styles.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/CallsPage.tsx": "Empty file with no implementation.",
  "frontend/src/pages/ChatDetailPage.tsx": "Chat detail view that loads messages with a user, supports replies and video attachments, and sends new messages.",
  "frontend/src/pages/FriendsPage.tsx": "Displays friends list with options to add, remove, search users, and toggle best-friend status.",
  "frontend/src/pages/InboxPage.tsx": "Shows conversation list based on friends and loads their profiles for navigation to chat pages.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page allowing editing of username, display name, and profile picture.",
  "frontend/src/pages/RoomChatPage.tsx": "Room-based group chat that loads room data, participants' profiles, messages, and allows sending new messages.",
  "frontend/src/pages/RoomsPage.tsx": "Lists available rooms and provides dialogs for creating rooms, copying join codes, and joining by code.",
  "frontend/src/pages/SettingsPage.tsx": "Renders the settings UI allowing users to toggle dark mode, change theme color with live preview, and save preferences via profile update hooks.",
  "frontend/src/pages/SignInPage.tsx": "Provides Internet Identity login and guest sign‑in flow with form handling, loading states, and navigation.",
  "frontend/src/theme/ThemeProvider.tsx": "Supplies theme context, syncing user profile theme settings and applying OKLCH‑based CSS variables for light and dark modes.",
  "frontend/src/utils/blob.ts": "Converts File or Blob objects into ExternalBlob instances by reading their bytes.",
  "frontend/src/utils/color.ts": "Converts hex colors to OKLCH format through RGB → XYZ → OKLab conversions with clamping.",
  "frontend/src/utils/rooms.ts": "Generates random 6‑character join codes and validates them against allowed patterns.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom fonts, OKLCH‑based theme colors, animations, and plugins.",
  "project_state.json": "Defines the project’s current state, including features, architecture notes, and known issues for the MessageCenter app, with indicators that fixes are requested. It outlines supported functionality like identity, messaging, rooms, video features, profile settings, and theming."
}