{
  "backend/main.mo": "Motoko canister implementing user profiles, messaging, calls, friends, and blob storage with authorization and various types and state maps.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON-like mapping of frontend file paths to short functional descriptions for reference or documentation.",
  "frontend/index.css": "Tailwind base and theme variable definitions providing light/dark mode OKLCH color tokens and global styles.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication gating, theme provider, and profile setup modal logic.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders a chat message bubble with reply previews, timestamps, and optional video content.",
  "frontend/src/components/chat/VideoMessageItem.tsx": "Displays a video message with loading state, playback, and star rating functionality.",
  "frontend/src/components/common/Avatar.tsx": "Shows a user avatar using profile picture blob URL or a default image with size options.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application shell with top bar, user dropdown, bottom navigation, and routing-aware navigation behavior.",
  "frontend/src/components/profile/ProfilePicturePicker.tsx": "Provides a dialog for selecting or capturing a profile picture and uploading it to update the user's profile.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal to create initial user profile with username and display name, calling the save profile hook.",
  "frontend/src/components/ratings/StarRating.tsx": "Implements an interactive 1–5 star rating component with hover, half-star support, and optional read-only mode.",
  "frontend/src/components/video/VideoRecorderModal.tsx": "Displays a modal for recording a video via the device camera and passing the captured result to a callback.",
  "frontend/src/components/video/VideoTrimmer.tsx": "Shows a simple UI for previewing and selecting trim points for a recorded video before sending the original blob.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides React Query hooks for fetching and updating the current user's profile and profile picture via the backend actor.",
  "frontend/src/hooks/useInboxFriendProfiles.ts": "Fetches and maps friend profiles in parallel using React Query and the backend actor, returning a principal-to-profile map.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for messaging, calls, friends, and related mutations using the backend actor.",
  "frontend/src/hooks/useVideoRatings.ts": "Implements a mock localStorage‑based video rating hook with submit and state management.",
  "frontend/src/index.css": "Tailwind CSS base configuration defining theme variables, dark mode values, and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider wrapping the root component.",
  "frontend/src/pages/CallsPage.tsx": "Renders call history, pending calls, and UI to initiate or respond to calls using related hooks.",
  "frontend/src/pages/ChatDetailPage.tsx": "Displays a chat thread with messaging, replies, video recording support, and auto‑scrolling behavior.",
  "frontend/src/pages/FriendsPage.tsx": "Renders the friends list with add/remove/best-friend actions and a search dialog for finding new friends.",
  "frontend/src/pages/InboxPage.tsx": "Displays a list of friends as message threads, loading their profiles and linking to chat pages.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the current user's profile with editable username, display name, and profile picture.",
  "frontend/src/pages/SettingsPage.tsx": "Provides theme settings including dark mode and theme color updates synced to the user profile.",
  "frontend/src/pages/SignInPage.tsx": "Handles Internet Identity sign‑in with loading and error states.",
  "frontend/src/theme/ThemeProvider.tsx": "Manages global theme state, syncing dark mode and theme color to the user's profile and applying them to the DOM.",
  "frontend/src/utils/blob.ts": "Converts File or Blob objects into ExternalBlob instances using byte extraction.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, supporting hash‑based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores high-level project state, including app summary, architecture notes, known issues, and a list of implemented feature definitions."
}