{
  "backend/main.mo": "Main actor implementing authorization, blob storage mixins, and core features for user profiles, messaging, and friend lists.",
  "backend/migration.mo": "Migration module converting old state (including calls) to the new actor state without call data.",
  "feature_evidence.json": "Feature evidence report listing removed call-related frontend components and app renaming to MessageCenter.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing each frontend file's purpose and recent updates.",
  "frontend/index.css": "Tailwind base and dark mode theme variables defining the app's OKLCH color system and global styles.",
  "frontend/index.html": "HTML entry point setting the document title to MessageCenter and loading the React app root.",
  "frontend/src/App.tsx": "Main React app wiring routes, authentication gating, theme provider, and profile setup modal.",
  "frontend/src/components/chat/MessageItem.tsx": "Renders an individual chat message with reply preview, timestamp, and optional video content.",
  "frontend/src/components/chat/VideoMessageItem.tsx": "Displays a video message with loading state and interactive star rating tied to local rating hooks.",
  "frontend/src/components/common/Avatar.tsx": "Renders a user avatar image with size options, falling back to a default image if none is provided.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main application layout with top bar, bottom navigation, user menu, and routing hooks.",
  "frontend/src/components/profile/ProfilePicturePicker.tsx": "Modal for selecting or capturing a new profile picture, converting it to an ExternalBlob and uploading it.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for first‑time users to create a profile, handling username and display name submission.",
  "frontend/src/components/ratings/StarRating.tsx": "Interactive star rating component supporting hover, half-stars, read-only mode, and size variations.",
  "frontend/src/components/video/VideoRecorderModal.tsx": "Modal for recording video via webcam, handling recording state, preview, cancellation, and sending as ExternalBlob.",
  "frontend/src/components/video/VideoTrimmer.tsx": "Video preview and trimming UI that allows selecting start/end points but sends the full original blob.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, invalidating dependent queries on changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks for fetching and mutating the current user's profile and profile picture via the backend actor.",
  "frontend/src/hooks/useInboxFriendProfiles.ts": "Fetches and caches profiles for a list of friend principals using multiple parallel queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, including loading, login, logout, and identity state handling.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for messages, friends, profiles, and user search, including mutations and cache updates.",
  "frontend/src/hooks/useVideoRatings.ts": "Implements a mock video rating hook storing ratings in localStorage with simple averaging and update logic.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes, applying global colors and typography.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CallsPage.tsx": "Empty page placeholder for calls functionality.",
  "frontend/src/pages/ChatDetailPage.tsx": "Displays a chat thread with a user, handles sending messages, replies, video attachments, and auto‑scrolling.",
  "frontend/src/pages/FriendsPage.tsx": "Manages the friends list with add, remove, best‑friend toggle, and search features using dialogs and UI components.",
  "frontend/src/pages/InboxPage.tsx": "Shows a list of friends as chat entries, loading associated profiles and navigating to chat threads.",
  "frontend/src/pages/ProfilePage.tsx": "Renders the user profile page with editable username/displayName and a profile picture picker, using hooks to load and update the caller's profile.",
  "frontend/src/pages/SettingsPage.tsx": "Provides UI for changing dark mode and theme color preferences, saving updates to the user profile.",
  "frontend/src/pages/SignInPage.tsx": "Displays a sign-in screen and triggers Internet Identity login with loading and error states.",
  "frontend/src/theme/ThemeProvider.tsx": "Supplies theme context (dark mode and primary color), syncing values with the user profile and applying them to the document.",
  "frontend/src/utils/blob.ts": "Converts File or Blob objects into ExternalBlob instances by reading their byte data.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing params.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors via CSS variables, typography and animation plugins, and extended theme settings.",
  "project_state.json": "Defines the project's current state, features, requirements, notes, and tracked issues."
}