{
  "kind": "build_request",
  "title": "Remove call feature and rename app to MessageCenter",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Remove the entire call feature from the backend Motoko canister, including all call-related types, state, and public methods, so the canister interface no longer exposes any call APIs.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-7",
          "recent-messages-9",
          "recent-messages-11"
        ],
        "quotes": [
          "remove the call feature since we cant have real calls.",
          "Just confirm: do you want **everything related to calls fully removed** from both backend and frontend?",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo no longer defines CallStatus or Call types.",
        "backend/main.mo no longer keeps call-related state (e.g., calls map, nextCallId).",
        "backend/main.mo no longer exposes initiateCall, updateCallStatus, or getCallHistory.",
        "The generated Candid/TypeScript declarations no longer include call types or call methods, and the project compiles."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Remove the entire call feature from the frontend UI and data layer, including the Calls page, the /calls route, call-related React Query hooks, and any navigation entries or icons that link to calls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-7",
          "recent-messages-9",
          "recent-messages-11"
        ],
        "quotes": [
          "remove the call feature since we cant have real calls.",
          "Just confirm: do you want **everything related to calls fully removed** from both backend and frontend?",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/pages/CallsPage.tsx is removed or no longer referenced anywhere in the app build.",
        "frontend/src/App.tsx no longer imports CallsPage and no longer defines a /calls route.",
        "frontend/src/components/layout/AppShell.tsx bottom navigation no longer shows a “Calls” tab and does not navigate to /calls.",
        "frontend/src/hooks/useQueries.ts no longer exports useGetCallHistory, useInitiateCall, or useUpdateCallStatus, and there are no remaining call-related imports (Call, CallStatus).",
        "The frontend builds and runs without referencing call features."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Rename the app to “MessageCenter” in user-facing branding locations (e.g., header title and browser tab title) so the UI consistently shows the new app name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-10",
          "recent-messages-11"
        ],
        "quotes": [
          "and rename the app to MessageCenter",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "The top-bar app name displayed in the UI is “MessageCenter” (replacing the current “Connect”).",
        "frontend/index.html <title> is updated to “MessageCenter”.",
        "No remaining user-facing strings refer to the old app name(s) (e.g., “Connect”, “TalkingPalace”) in primary branding locations."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit files under frontend/src/components/ui or any paths listed in SYSTEM_CONTEXT.frontend.immutablePaths; compose existing UI components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing real-time voice/video calling, WebRTC calling, or any other live call functionality.",
    "Adding new communication features beyond removing calls and renaming the app."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {
      "projectName": "MessageCenter",
      "summary": "Build MessageCenter, a social communication app with messaging, video creation/sharing, video ratings, customizable profiles, theming (including dark/light mode), and a friends/best-friends list."
    },
    "fieldsToDelete": []
  }
}