{
  "kind": "build_request",
  "title": "Fix invalid room join codes and allow joining rooms without Internet Identity",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "Fix the room join-code lookup so that a valid room join code never fails with an \"Invalid join code\" error due to case or whitespace differences, and ensure user-facing error messages remain in English.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "for number 1, it said \"invalid code\".",
          "I told someone the exact code there was for a room I made, but it said it was invalid, so fix that."
        ]
      },
      "acceptanceCriteria": [
        "Joining a room with the correct code succeeds even if the entered code contains leading/trailing spaces.",
        "Joining a room with the correct code succeeds even if the entered code uses lowercase letters.",
        "If no room exists for the provided code, the backend traps with an English error message that clearly indicates the code is invalid (and the frontend shows a friendly English message)."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Make guest participation in rooms work end-to-end by ensuring room membership checks and room messaging authorization work for non-Internet-Identity participants (guests) using the same participant identifier that was used to join the room.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "also, make it so you don't need your internet identity to join a group"
        ]
      },
      "acceptanceCriteria": [
        "A user who is not signed in with Internet Identity (guest session) can join a room by code and is added to that room’s participants list using their guest participant identifier.",
        "After joining as a guest, the guest can load the room details and poll messages without receiving an \"Unauthorized: You are not a participant in this room\" error.",
        "After joining as a guest, the guest can send room messages successfully and those messages are visible to other participants via polling.",
        "Internet Identity users can still join, view, and send room messages without regression."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Update the Rooms join flow so users are not required to use Internet Identity to join a room, and the UI provides clear English feedback when joining fails.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12",
          "msg-13"
        ],
        "quotes": [
          "also, make it so you don't need your internet identity to join a group",
          "start the build"
        ]
      },
      "acceptanceCriteria": [
        "If the user has a guest session, the Rooms page \"Join Room\" flow successfully joins using the guest participant identity (no Internet Identity required).",
        "If the user is not signed in at all, the app directs them to the existing Sign In page and they can use \"Continue as Guest\" to proceed to Rooms and join successfully.",
        "When join fails due to an invalid code, the toast shows a friendly English message (e.g., \"Invalid join code. Please check and try again.\") rather than a raw trap string.",
        "When join fails due to the room being full, the toast shows a friendly English message indicating the 50 participant limit."
      ]
    }
  ],
  "constraints": [
    "Do not implement any offline room/group creation; the user confirmed \"you'll need internet for everything\".",
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not modify frontend files under frontend/src/components/ui or other paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding any offline-first behavior for rooms or messaging.",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Implementing real-time updates via WebSockets (rooms continue to use polling)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}