{
  "kind": "build_request",
  "title": "Add guest sign-in plus joinable chat rooms (code-based, max 50, polling updates)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Add a guest-mode alternative to Internet Identity sign-in where a user can enter a username and display name without using Internet Identity, and then access the app as a guest without being blocked by the existing authentication gate.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "add a feature where you can directly put in your username and display name without needing to sign in.",
          "for number 1, keep the internet identity sign in while the guest mode will be an alternitive way of signing in."
        ]
      },
      "acceptanceCriteria": [
        "The sign-in screen offers both options: \"Sign In with Internet Identity\" and \"Continue as Guest\" (or equivalent) with username + display name inputs.",
        "Submitting guest username + display name stores a guest session locally (persisting across refresh) and routes into the authenticated app shell (Inbox/Friends/Profile/Settings remain reachable).",
        "Signing out clears the guest session as well as any Internet Identity session state, returning the user to the sign-in screen.",
        "User-facing text is in English."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Implement backend support for guest identities (not tied to the caller Principal) so guest users can have a stable in-app identity for room participation and messaging, without changing or removing existing Internet Identity-based user/profile behavior.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "add a feature where you can directly put in your username and display name without needing to sign in.",
          "keep the internet identity sign in while the guest mode will be an alternitive way of signing in."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a guest-oriented API surface that allows: creating/reading a guest profile and using that guest identity to interact with rooms and room messages.",
        "Existing Principal-based profile APIs and 1:1 messaging APIs continue to work for Internet Identity users without behavior regressions.",
        "Guest identity values are generated/managed in a way that avoids different guests overwriting each other’s data when using the anonymous principal (i.e., the guest identity key must not be the anonymous Principal)."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Add a new Rooms feature (separate from existing 1:1 chats): users can create a room that generates a join code, and other users can join a room using that code.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "instead of group chats, add rooms, where you can join the room with a code that the room host made.",
          "for number 3, yes"
        ]
      },
      "acceptanceCriteria": [
        "Backend supports creating a room with a host and a room join code, and joining a room by providing the code.",
        "Frontend provides UI to create a room (showing the generated code to the host) and to join a room via code input.",
        "Rooms are clearly presented as a separate section from 1:1 chats (do not replace/remove 1:1 chats).",
        "If a join code is invalid, the UI shows an English error message and does not navigate into a room."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Implement room messaging where all room participants can post messages, and messages update via periodic polling (no WebSockets).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-4"
        ],
        "quotes": [
          "in rooms, you can message each other at the same time.",
          "for number 2, yes."
        ]
      },
      "acceptanceCriteria": [
        "Backend stores room messages with sender identity, timestamp, and content, and exposes query methods suitable for polling (e.g., fetch latest messages, optionally since a timestamp/id).",
        "Frontend room chat screen renders messages and automatically refreshes using periodic polling (e.g., every few seconds) so new messages appear without manual refresh.",
        "Sending a room message causes it to appear for the sender immediately and for other participants on their next poll.",
        "The implementation does not use WebSockets or real-time push."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Enforce a maximum of 50 participants per room, preventing additional joins beyond the limit and providing a clear English error message when the room is full.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the maximum number of people that can be in a room is 50 people."
        ]
      },
      "acceptanceCriteria": [
        "Backend prevents joining a room once it already has 50 participants.",
        "Frontend displays a clear English error message when a user attempts to join a full room.",
        "When the room is at 49 participants, the next join succeeds; when at 50, further joins fail consistently."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Add Rooms navigation to the app shell so users can access Rooms alongside existing screens, without modifying immutable hook files.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "add rooms, where you can join the room with a code that the room host made.",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "Bottom navigation includes a \"Rooms\" entry that routes to a Rooms page.",
        "A user can navigate: Rooms list -> Create room / Join room -> Room chat screen.",
        "No files under the declared immutable frontend paths are modified; any new data fetching uses new hooks/files or existing mutable hooks."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; keep all Motoko logic in that actor.",
    "Only add backend/migration.mo if state migration is required for existing deployed state (conditional migration policy).",
    "Do not modify frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose instead).",
    "Room message updates must use periodic polling (no WebSockets / push).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Removing or rewriting the existing 1:1 chats feature (rooms must be added as a separate feature).",
    "Removing Internet Identity sign-in (it must remain available).",
    "Implementing true real-time messaging via WebSockets or other push technologies.",
    "Adding external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}