{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Guest-friendly room joining and participantId wiring for rooms",
  "requirements": [
    {
      "id": "REQ-31",
      "summary": "Ensure guest participants can load room details, poll messages, and send messages by consistently using the same participant identifier in all room-related calls.",
      "acceptanceCriteria": [
        "A user who is not signed in with Internet Identity (guest session) can join a room by code and is added to that room’s participants list using their guest participant identifier.",
        "After joining as a guest, the guest can load the room details and poll messages without receiving an \"Unauthorized: You are not a participant in this room\" error.",
        "After joining as a guest, the guest can send room messages successfully and those messages are visible to other participants via polling.",
        "Internet Identity users can still join, view, and send room messages without regression."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useRooms.ts",
          "operation": "modify",
          "description": "Wire room data fetching to the backend interface by passing the active participantIdentity.id to room-related backend capabilities (list rooms, get room details, leave room), and align function signatures with frontend/src/backend.d.ts. Ensure the react-query keys include participantIdentity.id so guest vs authenticated caches do not mix."
        },
        {
          "path": "frontend/src/hooks/useRoomMessagesPolling.ts",
          "operation": "modify",
          "description": "Update polling and send-message hooks to pass participantIdentity.id into room messaging backend capabilities (poll messages, send message) and to include participantIdentity.id in query keys. Add friendly handling for authorization failures so guests don’t see raw trap text."
        },
        {
          "path": "frontend/src/pages/RoomChatPage.tsx",
          "operation": "modify",
          "description": "Adjust room chat usage of hooks so loading room details, polling messages, and sending messages all operate with the active participant identity (guest or Internet Identity). Ensure user-facing error feedback remains friendly and in English if room access fails."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Allow joining rooms without Internet Identity and show clear English feedback during join failures.",
      "acceptanceCriteria": [
        "If the user has a guest session, the Rooms page \"Join Room\" flow successfully joins using the guest participant identity (no Internet Identity required).",
        "If the user is not signed in at all, the app directs them to the existing Sign In page and they can use \"Continue as Guest\" to proceed to Rooms and join successfully.",
        "When join fails due to an invalid code, the toast shows a friendly English message (e.g., \"Invalid join code. Please check and try again.\") rather than a raw trap string.",
        "When join fails due to the room being full, the toast shows a friendly English message indicating the 50 participant limit."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SignInPage.tsx",
          "operation": "modify",
          "description": "Preserve the user’s intended destination when the app shows the Sign In page due to missing authentication, so that after \"Continue as Guest\" the user returns to Rooms (or the originally requested route) and can join successfully. Keep all user-facing error messages in English."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the unauthenticated gating flow reliably renders the existing Sign In page while retaining the current route intent, so users can proceed as guest and then continue to Rooms without manual navigation."
        },
        {
          "path": "frontend/src/pages/RoomsPage.tsx",
          "operation": "modify",
          "description": "Keep the join-code normalization behavior (trim + case normalization) and ensure join failures always surface friendly English toasts (invalid code vs room full) using the error mapping provided by the join hook."
        }
      ]
    }
  ]
}